TexasInstruments/simplelink-lowpower-f2-sdk/examples/rtos/LP_CC2652R7/ble5stack/simple_peripheral_oad_onchip/tirtos/simple_peripheral_oad_onchip.syscfg
    /*
    * If Task.enableIdleTask is set to true, this option sets the idle task's
    * stack size.
    *
    * Reducing the idle stack size yields greater memory savings.
    */
    Task.idleTaskStackSize = 768;

    /*
    * Reduce the number of task priorities.
    * The default is 16.
    * Decreasing the number of task priorities yield memory savings.
    */
    Task.numPriorities = 6;


    /* ================ Additional configuration ================ */
    /*
    * Add a few other commonly used modules.
    */
    const Event = scripting.addModule("/ti/sysbios/knl/Event");
    const Mailbox = scripting.addModule("/ti/sysbios/knl/Mailbox");
    const Timestamp = scripting.addModule("/ti/sysbios/runtime/Timestamp");
    /* ================ Kernel (SYS/BIOS) configuration ================ */
        /*
        * Enable asserts in the BIOS library.
        *
        * Pick one:
        *  - true (default)
        *      Enables asserts for debugging purposes.
        *  - false
        *      Disables asserts for a reduced code footprint and better performance.
        *
        *  When using BIOS in ROM:
        *      This option must be set to false.
        */
        //BIOS.assertsEnabled = true;
        BIOS.assertsEnabled = false;
        /* ================ Remove once we have silicon  ================ */
        BIOS.cpuFrequency = 48000000;
        /* ================ GateMutexPri configuration ================ */
        var GateMutexPri = scripting.addModule("/ti/sysbios/gates/GateMutexPri");
}
